БухЭксп/Catalogs/CW_ЭтапыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЭтапыСогласования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокСогласованияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеЗавершение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МаршрутСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаСогласования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_СобытияСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Замечания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокСогласования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получено</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаетСогласования</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОбъектыНаСогласовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбъектыНаСогласовании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокСогласованияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЭтапыСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СостояниеСогласованияОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СостояниеСогласованияОбъекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прервано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЭтапыСогласования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписатьОбъектНаСогласование") Тогда
		Если ЭтотОбъект.ДополнительныеСвойства.ЗаписатьОбъектНаСогласование Тогда
			
			мОжидаютСогласования = МаршрутСогласования.НайтиСтроки(Новый Структура("ОжидаетСогласования", Истина));
			мДанныеДляЗаписи = новый Массив;
			Для Каждого СтрокаМаршртуа из мОжидаютСогласования Цикл
				СтруктураСогласования = Новый Структура;
				СтруктураСогласования.Вставить("ГруппаСогласования",  		СтрокаМаршртуа.ГруппаСогласования);
				СтруктураСогласования.Вставить("Пользователь",  			СтрокаМаршртуа.Пользователь);
				СтруктураСогласования.Вставить("ЭтапСогласования", 			Ссылка);
				
				СтруктураСогласования.Вставить("ДатаНачала", 				СтрокаМаршртуа.Получено);
				СтруктураСогласования.Вставить("ДатаПланЗавершения", 		СтрокаМаршртуа.ПлановаяДата);
				СтруктураСогласования.Вставить("ПорядокСогласования", 		ПорядокСогласования);
				СтруктураСогласования.Вставить("Комментарий",				"");
			
				мДанныеДляЗаписи.Добавить(СтруктураСогласования);
			КонецЦикла;
			
			//Добавляем инициатора
			СтруктураСогласования = Новый Структура;
			СтруктураСогласования.Вставить("ГруппаСогласования",	ПредопределенноеЗначение("Справочник.CW_ГруппыСогласования.ПустаяСсылка"));
			СтруктураСогласования.Вставить("Пользователь",			Инициатор);
			СтруктураСогласования.Вставить("ЭтапСогласования",		Ссылка);
			
			СтруктураСогласования.Вставить("ДатаНачала",			ДатаНачала);
			СтруктураСогласования.Вставить("ДатаПланЗавершения",	ПлановаяДатаЗавершения);
			СтруктураСогласования.Вставить("ПорядокСогласования",	ПорядокСогласования);
			СтруктураСогласования.Вставить("Комментарий",			Комментарий);
			
			мДанныеДляЗаписи.Добавить(СтруктураСогласования);
			
			РегистрыСведений.CW_ОбъектыНаСогласовании.ЗаписатьОбъектНаСогласование(ОбъектСогласования, мДанныеДляЗаписи);
			
			Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОповеститьИнициатора") Тогда
				ОповеститьИнициатора = ЭтотОбъект.ДополнительныеСвойства.ОповеститьИнициатора;
			КонецЕсли;
			
			Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОповеститьПользователей") Тогда
				ОповеститьПользователей = ЭтотОбъект.ДополнительныеСвойства.ОповеститьПользователей;
			КонецЕсли;

			CW_СогласованиеСервер.ОповеститьПользователейПоСогласованию(Ссылка, ОповеститьПользователей, ОповеститьИнициатора);
			
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтменитьОбъектНаСогласование") Тогда
		Если ЭтотОбъект.ДополнительныеСвойства.ОтменитьОбъектНаСогласование Тогда
			РегистрыСведений.CW_ОбъектыНаСогласовании.ОчиститьДанныеРегистра(ОбъектСогласования);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписатьСостояниеОбъекта")
		И ЭтотОбъект.ДополнительныеСвойства.ЗаписатьСостояниеОбъекта Тогда
		РегистрыСведений.CW_СостояниеСогласованияОбъекта.ЗаписатьСостояниеОбъекта(ОбъектСогласования, ЭтотОбъект.ДополнительныеСвойства.СостояниеОбъекта);
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ВсегоЭтапов  	= Справочники.CW_ЭтапыСогласования.ПолучитьКоличествоЭтаповОбъектаСогласования(ОбъектСогласования);
	Наименование 	= "Этап "+Строка(ВсегоЭтапов+1);
	
	ДатаНачала  	= Неопределено;
	ПлановаяДатаЗавершения  = Неопределено;
	ДатаЗавершения  		= Неопределено;
	СостояниеСогласования  	= ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик");
	Завершен		= Ложь;
	
	Для Каждого СтрокаТабличнойЧасти из  МаршрутСогласования Цикл
		СтрокаТабличнойЧасти.Событие 				= ПредопределенноеЗначение("Перечисление.CW_СобытияСогласования.ПустаяСсылка");
		СтрокаТабличнойЧасти.ДатаСобытия 			= Неопределено;
		СтрокаТабличнойЧасти.Замечания 				= "";
		СтрокаТабличнойЧасти.ПлановаяДата 			= Неопределено;
		СтрокаТабличнойЧасти.Получено 				= Неопределено;
		СтрокаТабличнойЧасти.Продолжительность 		= 0;
		СтрокаТабличнойЧасти.ОжидаетСогласования 	= Ложь;
	КонецЦикла;
	
КонецПроцедуры


#КонецЕсли
